c5/src/Documents/Permission/Permission.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Permission</name>
  <posting>Deny</posting>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>Document</name>
    <type>
      <types>DocumentRef.Invoice</types>
      <types>DocumentRef.InvoiceRecord</types>
    </type>
  </attributes>
  <attributes>
    <name>Expired</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Resolution</name>
    <type>
      <types>EnumRef.AllowDeny</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Restrictions</name>
    <attributes>
      <name>Reason</name>
      <type>
        <types>EnumRef.RestrictionReasons</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/Enums/AllowDeny/AllowDeny.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AllowDeny</name>
  <enumValues>
    <name>Allow</name>
  </enumValues>
  <enumValues>
    <name>Deny</name>
  </enumValues>
</mdclass:Enum>

c5/src/Documents/Permission/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	if ( Object.Ref.IsEmpty () ) then
		raise Output.InteractiveCreationForbidden ();
	endif;
	completed = not ( Object.Responsible.IsEmpty ()
		or Object.Resolution.IsEmpty () );
	if ( not completed
		and SalesRestriction.CanApprove () ) then
		init ();
	endif;
	readAppearance ();
	Appearance.Apply ( ThisObject );

EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|Expired show Object.Resolution = Enum.AllowDeny.Allow;
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtServer
Procedure init ()
	
	Object.Responsible = SessionParameters.User;

EndProcedure

&AtServer
Procedure AfterWriteAtServer ( CurrentObject, WriteParameters )
	
	notifyUser ();
	
EndProcedure

&AtServer
Procedure notifyUser ()
	
	p = new Structure ( "Creator, Document, Resolution, Responsible" );
	FillPropertyValues ( p, Object );
	params = new Array ();
	params.Add ( p );
	Jobs.Run ( "PermissionsMailing.NotifyUser", params, , , TesterCache.Testing () );
	
EndProcedure

&AtClient
Procedure AfterWrite ( WriteParameters )

	Notify ( Enum.MessagePermissionIsSaved (), Object.Document );

EndProcedure

// *****************************************
// *********** Form events

&AtClient
Procedure ResolutionOnChange ( Item )
	
	setExpiration ();
	Appearance.Apply ( ThisObject, "Object.Resolution" );

EndProcedure

&AtClient
Procedure setExpiration ()
	
	if ( Object.Resolution = PredefinedValue ( "Enum.AllowDeny.Deny" ) ) then
		Object.Expired = undefined;
	else
		Object.Expired = SessionDate () + 86400;
	endif;

EndProcedure
